app/Models/SiswaModel.php

SELECT `siswa`.*, `guru`.`n_guru` as `n_guru`, `rombel`.`n_rombel` as `n_rombel`, `rombel`.`tingkat` as `tingkat`
FROM `siswa`
JOIN `guru` ON `siswa`.`id_guru` = `guru`.`id_guru`
JOIN `rombel` ON `siswa`.`id_rombel` = `rombel`.`id_rombel`
---
    public function getSiswa()
    {
        return $this->select('siswa.*, guru.n_guru as n_guru, rombel.n_rombel as n_rombel, rombel.tingkat as tingkat')
        ->join('guru', 'siswa.id_guru = guru.id_guru')
        ->join('rombel', 'siswa.id_rombel = rombel.id_rombel')
        ->findAll();